Tekla Open API Reference for Tekla Structures 2025
AnalysisModel Fields
The AnalysisModel type exposes the following members.
Fields
Name | Description
PART_DEFAULTS_MODEL_NAME
 The analysis model name for default analysis properties of a part.
Top
See Also
Reference
AnalysisModel Class
Tekla.Structures.Analysis Namespace